ChordsLearning/app/controllers/chords_controller.rb

SELECT "chords".* FROM "chords"
---
  def index
    @chords = Chord.all

INSERT INTO "chords" ("chord", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["chord", "dasdada"], ["created_at", "2018-05-22 07:19:00.482483"], ["updated_at", "2018-05-22 07:19:00.482483"]]
---
  def create
    @chord = Chord.new(chord_params)

    respond_to do |format|
      if @chord.save

DELETE FROM "chords" WHERE "chords"."id" = $1  [["id", 1]]
---
  def destroy
    @chord.destroy

SELECT  "chords".* FROM "chords" WHERE "chords"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_chord
      @chord = Chord.find(params[:id])