ChordsLearning/app/controllers/search_controller.rb

SELECT "artists".* FROM "artists" WHERE (first_name || ' ' || last_name LIKE '%%')
SELECT "songs".* FROM "songs" WHERE (name || ' ' || artist LIKE '%%')
SELECT "chords".* FROM "chords" WHERE (first_name || ' ' || last_name LIKE '%%')
---
def index
  @artists = Artist.search params[:term]
  @songs = Song.search params[:term]
  @chords = Chord.search params[:term]