ChordsLearning/app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-05-22 06:34:57.568319"], ["updated_at", "2018-05-22 06:34:57.568319"]]