app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "id_artist", "song_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Bruno Mars"], ["id_artist", 2], ["song_id", 1], ["created_at", "2018-05-25 09:36:14.037745"], ["updated_at", "2018-05-25 09:36:14.037745"]]
---
  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save